soap/JEMS_ReceiveCourtFilingResponse.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Header>
    <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://10.1.26.48:50051/EventMessageConsumer/1</wsa:To>
    <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://jnet.state.pa.us/service/jnet/EventMessageConsumer/1/EventMessageConsumerInterface/NotifyRequest</wsa:Action>
    <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">1014-cde6-8fcf-d86f-1642-9934298</wsa:MessageID>
    <wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsse:Security xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <saml2:Assertion ID="1014-cde6-8fcf-d86f-1642-9934298" IssueInstant="2018-06-15T14:25:10.807Z" Version="2.0">
        <saml2:Issuer>https://ws.jnet.state.pa.us/SAML</saml2:Issuer>
        <saml2:Subject>
          <saml2:NameID>JNET</saml2:NameID>
        </saml2:Subject>
        <saml2:AuthnStatement AuthnInstant="2018-06-15T14:25:10.807Z">
          <saml2:AuthnContext>
            <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:unspecified</saml2:AuthnContextClassRef>
          </saml2:AuthnContext>
        </saml2:AuthnStatement>
      </saml2:Assertion>
    </wsse:Security>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:Notify xmlns:m="http://jnet.state.pa.us/message/jnet/EventMessageConsumer/1">
      <jnet:EventMessage xmlns:jnet="http://www.jnet.state.pa.us/niem/JNET/jnet-core/1" xmlns:nc="http://niem.gov/niem/niem-core/2.0">
        <nc:DocumentCategoryText>CourtFilingResponse</nc:DocumentCategoryText>
        <nc:DocumentIdentification>
          <nc:IdentificationID>1014-cde6-8fcf-d86f-1642-9934298</nc:IdentificationID>
        </nc:DocumentIdentification>
        <nc:DocumentPostDate>
          <nc:DateTime>2018-06-15T14:25:10.800Z</nc:DateTime>
        </nc:DocumentPostDate>
        <nc:DocumentSource>
          <nc:EntityOrganization>
            <nc:OrganizationName>AOPC</nc:OrganizationName>
          </nc:EntityOrganization>
        </nc:DocumentSource>
        <nc:DocumentSubjectText>CourtFilingResponse</nc:DocumentSubjectText>
        <jnet:Message>
          <m:ReceiveCourtFilingResponse toAgency="DOC" toURI="https%3A%2F%2Foactcaps219.pa.lcl%3A8443%2FEventMessageConsumer%2F" xmlns:ansi="http://www.it.ojp.gov/jxdm/ansi_d20/1.0" xmlns:aopc="http://jnet.state.pa.us/jxdm/aopc" xmlns:aopc-doc="http://us.pacourts.us/niem/aopc/CourtFiling/1" xmlns:aopc-ext="http://us.pacourts.us/niem/aopc/Extension/2" xmlns:j="http://www.it.ojp.gov/jxdm/3.0" xmlns:j4="http://niem.gov/niem/domains/jxdm/4.0" xmlns:jnet-m="http://www.jnet.state.pa.us/niem/jnet/metadata/1" xmlns:m="http://jnet.state.pa.us/message/aopc/CourtFiling/1" xmlns:ncic="http://www.it.ojp.gov/jxdm/ncic_2000/1.0" xmlns:nibrs="http://www.it.ojp.gov/jxdm/nibrs_misc/1.0" xmlns:ref="http://jnet.state.pa.us/jxdm/aopc/wsa-ref" xmlns:s="http://niem.gov/niem/structures/2.0" xmlns:usps="http://www.it.ojp.gov/jxdm/usps_states/1.0" xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <jnet-m:ResponseMetadata>
              <jnet-m:UserDefinedTrackingID>_E0070383-5_061418100003</jnet-m:UserDefinedTrackingID>
              <jnet-m:ResponseActionText>http://jnet.state.pa.us/jxdm/aopc/CourtFilingResponse/Rejected</jnet-m:ResponseActionText>
            </jnet-m:ResponseMetadata>
            <ref:AOPCFault>
              <ref:Code>aopc:E30001</ref:Code>
              <ref:Severity>aopc:error</ref:Severity>
              <ref:Reason>
                <ref:Text>XML Handler found: [Error] :92:16: cvc-complex-type.2.4.a: Invalid content was found starting with element 'AddressOther'. One of '{&quot;http://www.it.ojp.gov/jxdm/3.0&quot;:LocationStreet, &quot;http://www.it.ojp.gov/jxdm/3.0&quot;:LocationSecondaryUnitText, &quot;http://www.it.ojp.gov/jxdm/3.0&quot;:LocationCityName, &quot;http://www.it.ojp.gov/jxdm/3.0&quot;:LocationCountyName}' is expected.</ref:Text>
              </ref:Reason>
            </ref:AOPCFault>
            <ref:AOPCFault>
              <ref:Code>aopc:E30001</ref:Code>
              <ref:Severity>aopc:error</ref:Severity>
              <ref:Reason>
                <ref:Text>XML Handler found: [Error] :92:16: cvc-complex-type.2.4.b: The content of element 'AddressOther' is not complete. One of '{&quot;http://www.it.ojp.gov/jxdm/3.0&quot;:AddressComponentText}' is expected.</ref:Text>
              </ref:Reason>
            </ref:AOPCFault>
            <ref:AOPCFault>
              <ref:Code>aopc:E30001</ref:Code>
              <ref:Severity>aopc:error</ref:Severity>
              <ref:Reason>
                <ref:Text>XML Handler found: [Error] :93:16: cvc-complex-type.2.4.b: The content of element 'AddressOther' is not complete. One of '{&quot;http://www.it.ojp.gov/jxdm/3.0&quot;:AddressComponentText}' is expected.</ref:Text>
              </ref:Reason>
            </ref:AOPCFault>
            <Fault>
              <Code>
                <Value>Receiver</Value>
                <Subcode>
                  <Value>aopc:error</Value>
                  <Subcode>
                    <Value>aopc:E30001</Value>
                  </Subcode>
                </Subcode>
              </Code>
              <Reason>
                <Text xml:lang="en">XML Handler found: [Error] :93:16: cvc-complex-type.2.4.b: The content of element 'AddressOther' is not complete. One of '{&quot;http://www.it.ojp.gov/jxdm/3.0&quot;:AddressComponentText}' is expected.</Text>
              </Reason>
            </Fault>
          </m:ReceiveCourtFilingResponse>
        </jnet:Message>
      </jnet:EventMessage>
    </m:Notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>